src/cf/maERP_ib/src/Enums/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектов</name>
  <enumValues>
    <name>Проведён</name>
  </enumValues>
  <enumValues>
    <name>Записан</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Enums/СтатусыОбъектов/ManagerModule.bsl
Функция ПолучитьДляОбъекта(ДокОбъект) Экспорт
	Если ДокОбъект.Проведен Тогда
		Возврат Перечисления.СтатусыОбъектов.Проведён;	
	ИначеЕсли ДокОбъект.ПометкаУдаления Тогда
		Возврат Перечисления.СтатусыОбъектов.Удалён;	
	Иначе
		Возврат Перечисления.СтатусыОбъектов.Записан;	
	КонецЕсли;	
КонецФункции
